Revit 2026 API

# HomeCamera Constructor

---

Constructs a new copy of the input HomeCamera object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HomeCamera(
	HomeCamera other
)
```
```vb
Public Sub New (
	other As HomeCamera
)
```
```cpp
public:
HomeCamera(
	HomeCamera^ other
)
```
```fsharp
new :
        other : HomeCamera -> HomeCamera
```

#### Parameters

other HomeCamera

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

HomeCamera Class

Autodesk.Revit.DB Namespace